backend/controllers/VisitantmasterController.php

     public function actionCheckout($id)
    {
        $model= $this->findModel($id);
        $v=Visitanttransaction::find()->where(['visitor_id' =>$id,'checkout_time'=> null])->one();

        if($model!= null &&  $v!= null)
        {
            if(($v->checkout_time)==null)
            {

                $datetime=gmdate("Y-m-d H:i:s",strtotime('+5 hours 30 minutes'));
                $v->checkout_time=$datetime;
                $v->save();
---
SELECT * FROM `visitanttransaction` WHERE (`visitor_id`='17') AND (`checkout_time` IS NULL)
UPDATE `visitanttransaction` SET `checkout_time`='2018-01-18 11:35:41' WHERE `id`=19

     public function actionCreatevisitor($id)
    {
        $model =new Visitanttransaction();
        $visitantmaster=$this->findModel($id);

        if($model->load(Yii::$app->request->post()))
        {
            $emp=Employee::find()->where(['empid'=>$model->emp_id])->one();
---
SELECT * FROM `employee` WHERE `empid`='7'

                $model->checkin_time=$datetime;
                $model->save();
                $visitantmaster->status='active';
                $visitantmaster->save(false);
---
UPDATE `visitantmaster` SET `status`='active' WHERE `visitor_id`=14