backend/views/visitantmaster/createform.php

     <?php echo $form->field($model, 'purpose')->textarea(['rows' => '4','maxlength' => true,'style'=>['width' => '30%']]) ?>

      <?php
    echo $form->field($model, 'emp_id')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Employee::find()->all(),'empid','empname'),
        'language' => 'en',
        'options' => ['placeholder' => 'Select ...'],
        'pluginOptions' => [
            'allowClear' => true,
            'width' => '30%',
        ],
    ]); ?>
---
SELECT * FROM `employee`