backend/models/SendsmsQuery.php

SELECT * FROM `sendsms`
---
    public function all($db = null)
    {
        return parent::all($db);